Revit 2024 API
MetallicPaint.MetallicpaintTopcoat Property
 The property labeled "Top Coat" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetallicpaintTopcoat { get; }
Visual Basic
Public Shared ReadOnly Property MetallicpaintTopcoat As String
	Get
Visual C++
public:
static property String^ MetallicpaintTopcoat {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintTopcoatType".
See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace